jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
/*******************************************************************************/
void WriteToSD_data(void)
{
  uint8_t  i ;
/**********交易流水号*********/
  WriteDatatoSD(data_hche);
  WriteDatatoSD(data_LS1);
  WriteDatatoSD(data_LS2);
  WriteDatatoSD(data_LS3);
  WriteDatatoSD(data_LS4);
  WriteDatatoSD(data_LS5);
  WriteDatatoSD(data_LS6);
  for(i=15;i<22;i++)
  {
   assert_hex_u8print(Record_buffer[i]);
   WriteDatatoSD(Temple_Data);
  }
  /**********餐品编号*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_ID1);
  WriteDatatoSD(data_ID2);
  WriteDatatoSD(data_ID3);
  WriteDatatoSD(data_ID4);
  WriteDatatoSD(data_LS6);
  for(i=53;i<57;i++)
  {
   assert_hex_u8print(Record_buffer[i]);
   WriteDatatoSD(Temple_Data);
  }
 /**********餐品数量*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_NB1);
  WriteDatatoSD(data_NB2);
  WriteDatatoSD(data_NB3);
  WriteDatatoSD(data_NB4);
  WriteDatatoSD(data_LS6);
  assert_hex_u8print(Record_buffer[60]);
  WriteDatatoSD(Temple_Data);
   /**********餐品价格*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_PR1);
  WriteDatatoSD(data_PR2);
  WriteDatatoSD(data_PR3);
  WriteDatatoSD(data_PR4);
   WriteDatatoSD(data_LS6);
  for(i=90;i<92;i++) //for(i=87;i<93;i++)
  {
   assert_hex_u8print(Record_buffer[i]);
   WriteDatatoSD(Temple_Data);
  }
 /**********支付方式*********/
   WriteDatatoSD(data_null);
   WriteDatatoSD(data_PS1);
   WriteDatatoSD(data_PS2);
   WriteDatatoSD(data_PS3);
	WriteDatatoSD(data_PS4);
	WriteDatatoSD(data_LS6);

    if(Record_buffer[96]=='1')
    {
      WriteDatatoSD(data_PS5);
	  WriteDatatoSD(data_PS6);
	}
	else if(Record_buffer[96]=='2')
	{
	  WriteDatatoSD(data_PS7);
	  WriteDatatoSD(data_PS8);
	  WriteDatatoSD(data_PS9);
	}
	else if(Record_buffer[96]=='3')
	{
	  WriteDatatoSD(data_PS10);
	  WriteDatatoSD(data_PS11);
	  WriteDatatoSD(data_PS12);
	}
	else if(Record_buffer[96]=='4')
	{
	  WriteDatatoSD(data_PS12);
	  WriteDatatoSD(data_PS13);
	}
	else
	{
	}

	WriteDatatoSD(data_null);
/**********找零金额*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_ZL1);
  WriteDatatoSD(data_ZL2);
  WriteDatatoSD(data_ZL3);
  WriteDatatoSD(data_ZL4);
  WriteDatatoSD(data_LS6);
  for(i=103;i<105;i++) //for(i=100;i<106;i++)
  {
   assert_hex_u8print(Record_buffer[i]);
   WriteDatatoSD(Temple_Data);
  }
/**********剩余数量*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_SY1);
  WriteDatatoSD(data_SY2);
  WriteDatatoSD(data_SY3);
  WriteDatatoSD(data_SY4);
  WriteDatatoSD(data_LS6);
  for(i=109;i<111;i++)
  {
   assert_hex_u8print(Record_buffer[i]);
   WriteDatatoSD(Temple_Data);
  }
 /**********交易时间*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_TM1);
  WriteDatatoSD(data_TM2);
  WriteDatatoSD(data_TM3);
  WriteDatatoSD(data_TM4);
  WriteDatatoSD(data_LS6);
  for(i=15;i<17;i++)    //for(i=15;i<21;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  //年
   WriteDatatoSD(Temple_Data);
  }
   //WriteDatatoSD(tim1);
   assert_hex_u8print(Record_buffer[17]);  //月
   WriteDatatoSD(Temple_Data);
   //WriteDatatoSD(tim1);
   assert_hex_u8print(Record_buffer[18]);  //日
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(tim2);

   assert_hex_u8print(Record_buffer[19]);  //时
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(data_LS6);
   assert_hex_u8print(Record_buffer[20]);  //分
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(data_LS6);
   assert_hex_u8print(Record_buffer[21]);  //秒
   WriteDatatoSD(Temple_Data);


}


   /*******************************************************************************
 * 函数名称:DataUpload
 * 描    述:数据上传
 *
 * 输    入:无
 * 输    出:无
 * 返    回:void
 * 修改日期:2014年4月4日        ok
 *******************************************************************************/
extern uint8_t Current;
char mealvariety=0;
void DataUpload(void)
{
	char mealvariety=0;
	switch(mealvariety)
	{
		case 0:
		{
			mealvariety++;
			if(UserAct.MealCnt_1st_t>0)
			{
				UserAct.MealID = 0x01;
				itoa(f_name,TimeDate);	  //把时间转换成字符
				MealArr(UserAct.MealID);
				/*发送取餐数据给服务器*/
				memset(Record_buffer,0,254);
				if(TakeMealsFun(Record_buffer) == 0x01) //表示发送失败
				{
           Sd_Write('E');//发送失败
				}
				else 
					Sd_Write('Y');//改变当前最后两位为N0
				break;
			}
		}
		case 1:
		{
			mealvariety++;
			if(UserAct.MealCnt_2nd_t>0)
			{
				UserAct.MealID = 0x02;
				itoa(f_name,TimeDate);	  //把时间转换成字符
				MealArr(UserAct.MealID);
				/*发送取餐数据给服务器*/
				memset(Record_buffer,0,254);
				if(TakeMealsFun(Record_buffer) == 0x01) //表示发送失败
				{
           Sd_Write('E');
				}
				else 
					 Sd_Write('Y');//改变当前最后两位为N0
				break;
			}
		}
		case 2:
		{
			mealvariety++;
			if(UserAct.MealCnt_3rd_t>0)
			{
				UserAct.MealID = 0x03;
				itoa(f_name,TimeDate);	  //把时间转换成字符
				MealArr(UserAct.MealID);
				/*发送取餐数据给服务器*/
				memset(Record_buffer,0,254);
				if(TakeMealsFun(Record_buffer) == 0x01) //表示发送失败
				{
           Sd_Write('E');
				}
				else 
					 Sd_Write('Y');//改变当前最后两位为N0
				break;
			}
		}
		case 3:
		{
			mealvariety= 0;
			if(UserAct.MealCnt_4th_t>0)
			{
				UserAct.MealID = 0x04;
				itoa(f_name,TimeDate);	  //把时间转换成字符
				MealArr(UserAct.MealID);
				/*发送取餐数据给服务器*/
				memset(Record_buffer,0,254);
				if(TakeMealsFun(Record_buffer) == 0x01) //表示发送失败
				{
           Sd_Write('E');
				}
				else 
					 Sd_Write('Y');//改变当前最后两位为N0
				break;
			}
    }
	  default:break;
		//DataRecord();
  }
}

 /*******************************************************************************
* Function Name  : 取餐发送数据  OK
* Description    : 取餐发送数据
* Input          : void
* Output         : void
* Return         : void
    08 10 00 0f c0 00 01 24 c9 00 08 00 00 00 00 00 00 00 00 03 e8 47
   //应答码 2位          MAC 8位
*******************************************************************************/

CustomerSel__struction CustomerSel;

char ReadBuf[20]={0};
unsigned char TakeMealsFun1(unsigned char *SendBuffer)
 {
	 char temp[10]={0};
	 
	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j=0;
	 long  CmdLenght = 0 ;
   unsigned char	   Send_Buf[256]={0};	//要发送的数据啦
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 SearchSeparator(ReadBuf,SendBuffer,1); //读取包头
	 StringToHexGroup1(temp,ReadBuf,10);	 
	 /*水流号++*/
	 for(i=0;i<5;i++)
	 {
	  Send_Buf[i] =	temp[i] ;
	 }
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 //GetBRWN();
	 SearchSeparator(ReadBuf,SendBuffer,3); //读取流水号
	 StringToHexGroup1(temp,ReadBuf,14);
	 for(i=0;i<7;i++)
	 {
		 BRWN[3+i]=temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
//	 for(i=0;i<6;i++)
//	 {
//	   DealBalance[3+i] = CustomerSel.DealBalance[i] ;
//	 }
	 SearchSeparator(ReadBuf,SendBuffer,7); /*交易金额*/
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 DealBalance[3+i]=temp[i];
	 } 	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealBalance,sizeof(DealBalance)); /*交易金额(支付金额) */

//	 for(i=0;i<4;i++)
//	 {
//	  //这里赋值餐品的ID
//	   MealID[3+i] = CustomerSel.MealID[i] ; //(10000020)
//	 }
	 SearchSeparator(ReadBuf,SendBuffer,8); //餐品ID
	 StringToHexGroup1(temp,ReadBuf,8); 
   for(i=0;i<4;i++)
   {
		 MealID[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealID,sizeof(MealID)); /*餐品ID*/

	 /*这里赋值餐品的ID*/
//	 MealNO[3] = CustomerSel.MealNo;
	 SearchSeparator(ReadBuf,SendBuffer,9); //餐品数量
	 StringToHexGroup1(temp,ReadBuf,2);
 	 MealNO[3]=temp[0];
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealNO,sizeof(MealNO)); /*餐品购买数量*/

	  //这里赋值餐品的名字
//	  for(j=0;j<20;j++)
//	  MealName[3+j]=Meal[CustomerSel.MealName-1].MaelName[j];
	 SearchSeparator(ReadBuf,SendBuffer,10); //餐品名字
   for(i=0;i<20;i++)
   {
		 MealName[3+i]=ReadBuf[i];
	 }	
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealName,sizeof(MealName));			  /*餐品名字*/

