jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
	 /*这里赋值餐品的价格*/
	 
//	 for(i=0;i<6;i++)
//	 MealPrice[3+i] = CustomerSel.MealPrice[i] ;
	 SearchSeparator(ReadBuf,SendBuffer,11); //餐品价格
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 MealPrice[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));			/*餐品价格*/
	/*付钱的方式*/
	 //PayType[3] = CustomerSel.PayType ;
	 SearchSeparator(ReadBuf,SendBuffer,12); //付款方式
	 StringToHexGroup1(temp,ReadBuf,2);
 	 PayType[3]=temp[0];	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,sizeof(PayType));				/*支付方式*/
	 /*找零金额*/
//	 for(i=0;i<6;i++)
//	 Change[3+i] = CustomerSel.Change[i] ;
	 SearchSeparator(ReadBuf,SendBuffer,13); //找零金额
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 Change[3+i]=temp[i];
	 }		 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change)); 			   /*找零金额*/
	 /*剩余餐品数量*/
//	 for(i=0;i<2;i++)
//	 {
//	  RemainMealNum[3+i] = CustomerSel.RemainMealNum[i] ;
//    //printf("CustomerSel.RemainMealNum[i]=%d\r\n",CustomerSel.RemainMealNum[i]);
//	 }
	 SearchSeparator(ReadBuf,SendBuffer,14); //剩余餐品数量
	 StringToHexGroup1(temp,ReadBuf,4); 
   for(i=0;i<4;i++)
   {
		 RemainMealNum[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));					  /*MAC*/
 //  if(UserAct.PayType == '2' )																		/* 表示如果是刷卡*/
 //  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],STATUS.PacketData,STATUS.DataLength-17);				 /*记录刷卡信息*/
 //  if(UserAct.PayType == '3')
 //  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],STATUS.PacketData,STATUS.DataLength-17);				 /*记录刷卡信息*/
	 SearchSeparator(ReadBuf,SendBuffer,15); //剩余餐品数量
	 StringToHexGroup1(temp,ReadBuf,4); 
   for(i=0;i<2;i++)
   {
		 Change[3+i]=temp[i];
	 }
	 
	 Send_Buf[CmdLenght] = 0x03  ;  //包含数据包包尾标识和CRC校验码
	 CmdLenght+=0x03;
   i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght); //发送数据(取餐交易)
   mem_copy00(SendBuffer, Send_Buf,CmdLenght);	//把发送的参数传入数组写入SD卡
 /***************************************************************************/
	 HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);	/*保存数据的长度*/

	 if(i == 0x01) /*判断是否超时*/
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 if(Lenght == 0x00)/*判断数据长度*/
	 return 1 ;
	 for(j=0;j<Lenght+7;j++)
	 {

 //   printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);

	  }
	  if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)  //表示正确
	  {

		 if(rx1Buf[7]==0x00)/*是否应答命令*/
		 {
			return 0 ;
		 }
		 if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		 {
		  //   Batch ++ ;	/*流水号自加*/
			return 1 ;
		 }

	  }
   return 0 ;

 }

char ReadSdBuff[256]={0};
char SendHostBuff[128]={0};
//void DataUpload(void)
//{
//	//读取SD卡中当天的数据
//	//读取第16个','后面的内容
//	//判断是否为'N',是则发送数据
//	//读取第16个','后面的内容
//  unsigned char DelteFlag = 0 ;//用来标记是否全部上传了数据的函数
//	unsigned char Times  = 0  ;
//	RTC_TimeShow();
//	itoa(f_name,TimeDate);	  //把时间转换成字符

//	  do
//	  {
//	     if(Fread(ReadSdBuff)== 0x00)					      //出错记录，然后跳出显示错误
//		   break ;
//    }while(1);
//	SearchSeparator(ReadBuf,ReadSdBuff,17);
//  if(ReadBuf[0]=='N')
//	{
//		 if(TakeMealsFun1(ReadSdBuff)==0);
//		 //在第十六个逗号后写Y
//		 
////		SearchSeparator(ReadBuf,ReadSdBuff,FH); //读取包头
////		memcpy_02(SendHostBuff,ReadBuf,6);
////		SearchSeparator(SendHostBuff,ReadSdBuff,TID); //读取TID
////		//读取Buffer
////		SendDataToHost();
//	}
//	if(ReadBuf[0]=='Y')
//	{
//				
//	}
//}



 /*******************************************************************************
 * 函数名称:StringToHexGroup1                                                                    
 * 描    述:将字符数组转换为hex数组,功能有所修改                                                                  
 *                                                                               
 * 输    入:                                                                   
 * 输    出:bool                                                                      
 * 返    回:void                                                               
 * 修改日期:2013年8月28日  
 *******************************************************************************/
bool StringToHexGroup1(unsigned char *OutHexBuffer, char *InStrBuffer, unsigned int strLength)
{
  unsigned int i, k=0;
  unsigned char HByte,LByte;
//	if(InStrBuffer[strLength-1]!=0x0A)
//		return false;
  for(i=0; i<strLength; i=i+2)
  {
    if(InStrBuffer[i]>='0' && InStrBuffer[i]<='9')
    {
      HByte=InStrBuffer[i]-'0';
    }
    else if(InStrBuffer[i]>='A' && InStrBuffer[i]<='F')
    {
      HByte=InStrBuffer[i]-'A' +10;
    }
    else
    {
      HByte=InStrBuffer[i];
      return false;
    }
    HByte=HByte <<4;
    HByte = HByte & 0xF0;
    if(InStrBuffer[i+1]>='0' && InStrBuffer[i+1]<='9')
    {
       LByte=InStrBuffer[i+1]-'0';
    }
    else if(InStrBuffer[i+1]>='A' && InStrBuffer[i+1]<='F')
    {
       LByte=InStrBuffer[i+1]-'A' +10;
    }
    else
    {
       LByte=InStrBuffer[i];
       return false;
    }
		OutHexBuffer[k++]=HByte |LByte;		
 }
 return true;
}
